[
  {
    "id": 1,
    "medicine_name": "Fexo 120mg",
    "description": "Fexo 120 is an antihistaminic medication. It treats allergy symptoms such as itching, swelling, and rashes by blocking the effects of a chemical messenger (histamine) in the body",
    "indications": "Allergic rhinitis, Hay fever, Urticaria, Allergy",
    "sideeffects": ">10% Vomiting (6-12%) 1-10% Headache (5-10%),Cough (4%),Diarrhea (3-4%),URTI (3%),Back pain (2-3%),Pyrexia (2%),Dysmenorrhea (2%),Dizziness (2%),Stomach discomfort (2%),Pain in extremity (2%),Somnolence (1-3%),Rhinorrhea (1-2%)",
    "contraindications": "Hypersensitivity.",
    "usageinstructions": "Should be taken on an empty stomach. Take before meals. Do not take w/ fruit juice.",
    "adultdose": "Adults: Allergic rhinitis: 120 mg once daily or 60 mg twice daily Urticaria: 180 mg once daily",
    "childdose": "Children: Tablet 2-12 years: 30 mg (1 spoonful) or 5 ml twice daily 6 months-2 years: 15 mg (1/2 spoonful) or 2.5 ml twice daily >12 years: 60 mg PO BID OR 180 mg PO qDay ODT 6-12 years: 30 mg PO BID",
    "manufacturer": "Square Pharmaceuticals PLC"
  },
  {
    "id": 2,
    "medicine_name": "Monas 10 mg",
    "description": "Monas 10 works by blocking the action of leukotriene, a chemical messenger. This reduces inflammation in the airways to prevent asthma and relieve symptoms of allergies.",
    "indications": "Asthma, Allergic rhinitis",
    "sideeffects": ">10% Headache (18.4%; similar to placebo) 1-10% >2% Abdominal pain,Eczema,Influenza,Laryngitis,Pharyngitis,Viral infection,Wheezing,Dental pain,Dizziness,Dyspepsia, Dental pain (2%),Dizziness (2%),Dyspepsia (2%)Elevated liver function tests (2%),Fever (2%),Gastroenteritis (2%),Nasal congestion (2%),Otitis (2%),Rash (2%),Urticaria (2%), >1% Bronchitis,Cough,Sinusitis,Upper respiratory tract infection <1% Allergic granulomatous angiitis (Churg-Strauss syndrome; rare),Cholestatic hepatitis (rare),Aggressive behavior, altered behavior, suicidal thoughts Potentially Fatal: Anaphylaxis, Churg-Strauss syndrome",
    "contraindications": "Hypersensitivity",
    "usageinstructions": "None",
    "adultdose": "Oral Chronic asthma Adult: As film-coated tab: 10 mg once daily in the evening. Allergic rhinitis Adult: 10 mg once daily. Prophylaxis of exercise-induced asthma Adult: 10 mg at least 2 hr prior to exercise; do not take additional doses w/in 24 hr. Elderly: No dosage adjustment needed. Hepatic impairment: Mild to moderate: No dosage adjustment needed....",
    "childdose": "Asthma Prophylaxis and maintenance treatment in patients aged >12 months <12 months: Safety and efficacy not established 12-24 months: 4 mg (granules) PO once daily in evening 2-6 years: 4 mg (chewable tablet or granules) PO once daily in evening 6-15 years: 5 mg (chewable tablet) PO once daily in evening >15 years: 10 mg (conventional tablet) PO once daily in evening Exercise-Induced Bronchospasm Prophylaxis 6-15 years: 5 mg (chewable tablet) PO 2 hours before exercise; do not take additional dose within 24 hours >15 years: 10 mg PO 2 hours before exercise; do not take additional dose within 24 hours If taking drug for another indication, do not take additional dose to prevent EIB Perennial Allergic Rhinitis <6 months: Safety and efficacy not established 6-24 months: 4 mg (granules) PO once daily 2-6 years: 4 mg (chewable tablet or granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily Seasonal Allergic Rhinitis <2 years: Safety and efficacy not established 2-6 years: 5 mg (chewable tablet) or 4 mg (granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily...",
    "manufacturer": "The ACME Laboratories LTD"
  },
  {
    "id": 3,
    "medicine_name": "Omidon 10mg",
    "description": "Omidon 10 is a prokinetic. It works on the region in the brain that controls vomiting. It also acts on the upper digestive tract to increase the movement of the stomach and intestines, allowing food to move more easily through the stomach.",
    "indications": "Gastritis, Lactation, Migraine, Nausea and vomiting, Gastroparesis, Non ulcer dyspepsia",
    "sideeffects": "Drowsiness, extrapyramidal reactions, galactorrhoea, gynaecomastia; constipation or diarrhoea, lassitude, decreased libido, skin rash, itch. Potentially Fatal: Convulsions, arrhythmias and cardiac arrest, dysrrhythmias in patients with CV disease or hypokalaemia, patients on cancer chemotherapy. Seizures; hypertensive crisis in patients with phaeochromocytoma",
    "contraindications": "Hypersensitivity. GI haemorrhage, obstruction and perforation, patients with prolactin releasing pituitary hormone, chronic admin or routine prophylaxis of postoperative nausea and vomiting.",
    "usageinstructions": "Should be taken on an empty stomach. Take 15-30 min before meals.",
    "adultdose": "Oral Adults: Nausea and vomiting 10-20 mg 4-8 hrly. Max: 80 mg/day. Non ulcer dyspepsia 10 mg 3-4 times daily. Max: 20 mg 3-4 times daily. Last dose to be taken at bedtime. Migraine 20 mg 4 hrly. Max: 4 doses/24 hr. Rectal: Nausea and vomiting 60 mg twice daily. Elderly: No dosage adjustment needed. Hepatic impairment: No dosage adjustment needed.",
    "childdose": "Oral Children : 0.2 - 0.4 mg/kg every 4 - 8 hours daily. Rectal Child: <12 yr >15 kg: 30 mg bid; >12 yr >35 kg: 60 mg bid",
    "manufacturer": "Incepta Pharmaceuticals LTD"
  },
  {
    "id": 4,
    "medicine_name": "Rosuva 10 mg",
    "description": "Rosuva 10 is a lipid-lowering medication (statin). It works by blocking an enzyme (HMG-CoA-reductase) that is required by the body to make cholesterol, thereby lowering \"bad\" cholesterol (LDL) and triglycerides and raising \"good\" cholesterol (HDL).",
    "indications": "Hyperlipidaemias, Primary hypercholesterolaemia (heterozygous familial hypercholesterolaemia), mixed dyslipidaemia, homozygous familial hypercholesterolaemia, Stroke prevention",
    "sideeffects": ">10% Myalgia (3-13%) 1-10% Arthralgia (10%),Diabetes mellitus, new onset (3%),Pharyngitis (9%),Headache (6%),Asthenia (up to 5%),Dizziness (4%),CPK increased (3%),Nausea (3%),Abdominal pain (2%),ALT increased (2%),Constipation (2%),Flulike illness (2%),UTI (2%) <1% Jaundice,Myopathy,Rhabdomyolysis Potentially Fatal: Rhabdomyolysis with acute renal failure.",
    "contraindications": "Severe renal impairment, active liver disease, unexplained persistent elevations of serum transaminases; hypersensitivity. Pregnancy, lactation.",
    "usageinstructions": "May be taken with or without food.",
    "adultdose": "Oral Hypercholesterolemia, Hypertriglyceridemia, hyperlipidemia, mixed dyslipidemiaProphylaxis of cardiovascular events in high-risk patients Adult: Initially, 5 or 10 mg once daily, may increase dose at 4-wkly intervals to 20 mg daily if necessary. Max: 40 mg once daily. Active liver disease: Use is contraindicated",
    "childdose": "Oral Child Heterozygous familial hypercholesterolaemia: >10 yr Initially, 5 mg once daily, may be adjusted at intervals of at least 4 wk. Max: 20 mg once daily.",
    "manufacturer": "Square Pharmaceuticals PLC"
  },
  {
    "id": 5,
    "medicine_name": "Montela 10mg",
    "description": "Montela 10 works by blocking the action of leukotriene, a chemical messenger. This reduces inflammation in the airways to prevent asthma and relieve symptoms of allergies.",
    "indications": "Asthma, Allergic rhinitis",
    "sideeffects": ">10% Headache (18.4%; similar to placebo) 1-10% >2% Abdominal pain,Eczema,Influenza,Laryngitis,Pharyngitis,Viral infection,Wheezing,Dental pain,Dizziness,Dyspepsia, Dental pain (2%),Dizziness (2%),Dyspepsia (2%)Elevated liver function tests (2%),Fever (2%),Gastroenteritis (2%),Nasal congestion (2%),Otitis (2%),Rash (2%),Urticaria (2%), >1% Bronchitis,Cough,Sinusitis,Upper respiratory tract infection <1% Allergic granulomatous angiitis (Churg-Strauss syndrome; rare),Cholestatic hepatitis (rare),Aggressive behavior, altered behavior, suicidal thoughts Potentially Fatal: Anaphylaxis, Churg-Strauss syndrome.",
    "contraindications": "Hypersensitivity",
    "usageinstructions": "None",
    "adultdose": "Oral Chronic asthma Adult: As film-coated tab: 10 mg once daily in the evening. Allergic rhinitis Adult: 10 mg once daily. Prophylaxis of exercise-induced asthma Adult: 10 mg at least 2 hr prior to exercise; do not take additional doses w/in 24 hr. Elderly: No dosage adjustment needed. Hepatic impairment: Mild to moderate: No dosage adjustment needed.",
    "childdose": "Asthma Prophylaxis and maintenance treatment in patients aged >12 months <12 months: Safety and efficacy not established 12-24 months: 4 mg (granules) PO once daily in evening 2-6 years: 4 mg (chewable tablet or granules) PO once daily in evening 6-15 years: 5 mg (chewable tablet) PO once daily in evening >15 years: 10 mg (conventional tablet) PO once daily in evening Exercise-Induced Bronchospasm Prophylaxis 6-15 years: 5 mg (chewable tablet) PO 2 hours before exercise; do not take additional dose within 24 hours >15 years: 10 mg PO 2 hours before exercise; do not take additional dose within 24 hours If taking drug for another indication, do not take additional dose to prevent EIB Perennial Allergic Rhinitis <6 months: Safety and efficacy not established 6-24 months: 4 mg (granules) PO once daily 2-6 years: 4 mg (chewable tablet or granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily Seasonal Allergic Rhinitis <2 years: Safety and efficacy not established 2-6 years: 5 mg (chewable tablet) or 4 mg (granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily",
    "manufacturer": "Delta Pharma Limited"
  },
  {
    "id": 6,
    "medicine_name": "Xorel 20mg",
    "description": "Xorel 20 is a proton pump inhibitor (PPI). It works by reducing the amount of acid in the stomach which helps in relief of acid related indigestion and heartburn.",
    "indications": "Peptic ulcer disease, H. pylori infection, Gastro-oesophageal reflux disease, Paediatric GERD",
    "sideeffects": "1-10% Headache (2-10%),Constipation (2%),Diarrhea (2-5%),Flatulence (3%),Pain (3%),Pharyngitis (3%),Abdominal pain (4%) <1% Agitation,Agranulocytosis,Alopecia,Anemia,Angioedema,Chest pain,Delirium,Erythema,Hypokalemia,Hypomagnesemia,Hyponatremia,Jaundice,Leukocytosis,Leukopenia,Migraine,Osteoporosis related fracture,Rhabdomyolysis,Stevens-Johnson syndrome,Sudden death,Toxic epidermal necrolysis,Abnormal taste",
    "contraindications": "Rabeprazole is contraindicated in patients with known hypersensitivity to Rabeprazole, other PPIs or to any component of the formulation.",
    "usageinstructions": "Administer with or without meals",
    "adultdose": "Oral Gastro-oesophageal reflux disease Adult: 20 mg daily for 4-8 wk. Maintenance: 10 or 20 mg/day. All doses to be taken once in the morning. Zollinger-Ellison syndrome Adult: Initially, 60 mg once in the morning, adjusted to max dose of 120 mg/day if needed. Daily doses >100 mg should be given in 2 divided doses. Peptic ulcer Adult: 20 mg once in the morning for 4-8 wk (duodenal ulcer) or for 6-12 wk (gastric ulcer). H.pylori infection Adult: 1-wk triple therapy: 20 mg bid combined w/ clarithromycin 500 mg bid and amoxicillin 1 g bid or combined w/ clarithromycin 250 mg bid and metronidazole 400 mg bid. Erosive oesophagitis Adult: 20 mg/day for 4-8 wk. May continue for another 8 wk if healing is incomplete. Maintenance: 10 or 20 mg/day. All doses to be taken once in the morning. Elderly: No dosage adjustment needed. Hepatic impairment: No dosage adjustment needed",
    "childdose": "Delayed-release capsule (sprinkles) <1 year: Safety and efficacy not established 1-11 years (<15 kg): 5 mg PO qDay 30 minutes before a meal, for up to 12 weeks; may increase to 10 mg/day if inadequate response 1-11 years (>15 kg): 10 mg PO qDay 30 minutes before a meal, for up to 12 weeks Gastroesophageal Reflux Disease Delayed-release tablet <12 years: Safety and efficacy not established >12 years: 20 mg PO qDay for up to 8 weeks",
    "manufacturer": "The Ibn Sina Pharmaceutical Ind. Ltd."
  },
  {
    "id": 7,
    "medicine_name": "Comet 500mg",
    "description": "Comet 500 is an anti-diabetic medication (biguanide). It works by lowering glucose production in the liver, delaying the absorption of sugar (glucose) from the intestines and increasing the body sensitivity to insulin",
    "indications": "Type 2 DM, Polycystic ovarian syndrome,",
    "sideeffects": "Anorexia, nausea, vomiting, diarrhoea, wt loss, flatulence, occasional metallic taste; weakness; hypoglycaemia; rash, malabsorption of vit B12. Chest discomfort, flushing, palpitation, chills, headache, lightheadedness, indigestion, abdominal discomfort. Potentially Fatal: Lactic acidosis in presence of renal failure and alcoholism. Patients may experience a metallic taste and there may be weight loss, which in some diabetics could be an advantage.",
    "contraindications": "Acute or chronic metabolic acidosis with or without coma (including diabetic ketoacidosis). Renal failure, severe renal or hepatic impairment, acute conditions which may affect renal function e.g. dehydration, severe infection or shock. Cardiac failure, CHF, IDDM, severe impairment of thyroid function; acute or chronic alcoholism. Acute or chronic diseases which may cause tissue hypoxia e.g. cardiac or respiratory failure, recent MI or shock. Pregnancy, lactation.",
    "usageinstructions": "Should be taken with food.",
    "adultdose": "Oral Type 2 diabetes mellitus Adult: Conventional preparation: Initially, 500 mg bid or tid, or 850 mg 1-2 times daily, may increase gradually to 2000 mg daily at intervals of at least 1 wk. Maximum daily dose of 2550 mg per day. Modified-release preparation: Initially, 500 mg once daily, may increase in increments of 500 mg at intervals of at least 1 wk to max 2000 mg once daily at night. If glycaemic control is not sufficient, dose may be divided to give 1000 mg bid. Not to exceed 2000 mg/day Polycystic ovary syndrome Initial: 500 mg/day in the morning for 1 wk, then 500 mg twice daily for 1 wk, then 1.5-1.7 g/day in 2-3 divided doses. Elderly: Initial and maintenance dosing should be conservative. Hepatic impairment: Avoid use; risk of lactic acidosis",
    "childdose": "Oral Type 2 diabetes mellitus Child: >10 yr Initially, 500 mg 1-2 times daily or 850 mg once daily, may increase gradually to max 2000 mg daily in 2 or 3 divided doses at intervals of at least 1 wk.",
    "manufacturer": "Square Pharmaceuticals PLC"
  },
  {
    "id": 8,
    "medicine_name": "Losectil 20mg",
    "description": "Losectil 20 is a proton pump inhibitor (PPI). It works by reducing the amount of acid in the stomach which helps in relief of acid related indigestion and heartburn.",
    "indications": "Peptic ulcer, H. pylori infection, Gastro-oesophageal reflux disease, Zollinger-Ellison syndrome, Oesophagitis, Acid-related dyspepsia, NSAID-associated ulceration",
    "sideeffects": "1-10% Headache (7%),Abdominal pain (5%),Diarrhea (4%),Nausea (4%),Vomiting (3%),Flatulence (3%),Dizziness (2%),Upper respiratory infection (2%),Acid regurgitation (2%),Constipation (2%),Rash (2%),Cough (1%) Frequency Not Defined Fracture of bone, osteoporosis-related,Hepatotoxicity (rare),Agranulocytosis,Anorexia,Gastric polyps,Hip fracture,Alopecia,Atrophic gastritis,Interstitial nephritis (rare),Pancreatitis (rare),Rhabdomyolysis,Taste perversion,Abnormal dreams,Toxic epidermal necrolysis (rare) Potentially Fatal: Anaphylaxis.",
    "contraindications": "Known hypersensitivity to any of its component.",
    "usageinstructions": "Delayed-release cap: Should be taken on an empty stomach. Take at least 1 hr before meals. Swallow whole, do not chew/crush. For patients w/ difficulty swallowing, cap may be carefully opened & entire contents sprinkled in a spoonful of applesauce. Swallow drug/food mixt w/o chewing immediately after prep. Drug/food mixt should not be stored for future use. Powd for oral susp: Should be taken on an empty stomach. Take on an empty stomach at least 1 hr before a meal. MUPS tab: May be taken with or without food. Cap: Should be taken with food. Take immediately before a meal",
    "adultdose": "Oral Peptic ulcer Adult: 20 or 40 mg/day in severe cases for 4 wk (duodenal ulcer) or for 8 wk (gastric ulcer). Maintenance: 10-20 mg/day. All doses to be taken once in the morning. NSAID-associated ulceration Adult: 20 mg once in the morning. Gastro-oesophageal reflux disease Adult: 20 mg/day for 4 wk may continue for another 4-8 wk if necessary. Refractory oesophagitis: 40 mg/day. Maintenance: 20 mg/day (after healing of oesophagitis); 10 mg/day (acid reflux). All doses to be taken once in the morning. Zollinger-Ellison syndrome Adult: Initially, 60 mg once in the morning, adjust as required. Dose Range: 20-120 mg/day. Doses >80 mg are administered in 2 divided doses. Prophylaxis of acid aspiration during general anaesthesia Adult: 40 mg given in the evening and another 40 mg 2-6 hr pre-op. Acid-related dyspepsia Adult: 10 or 20 mg once in the morning for 2-4 wk. Erosive oesophagitis Adult: 20 mg/day for 4-8 wk. Maintenance of healing: 20 mg/day for up to 12 mth. All doses to be taken once in the morning. H.pylori infection Adult: As triple therapy: 20 mg bid or 40 mg once daily combined w/ amoxicillin 500 mg and metronidazole 400 mg both tid or combined w/ clarithromycin 250 mg and metronidazole 400 mg (or tinidazole 500 mg) both bid or combined w/ amoxicillin 1 g and clarithromycin 500 mg both bid. Duration: 7 or 10 days. As 2-wk dual therapy: 20 mg bid or 40 mg/day combined w/ either amoxicillin 750 mg to 1 g bid or w/ clarithromycin 500 mg tid. Intravenous Gastro-oesophageal reflux disease; Gastric and duodenal ulcers; NSAID-associated ulceration Adult: 40 mg once daily infused over 20-30 min or slow inj over 5 min until oral admin is possible. Zollinger-Ellison syndrome Adult: Initially, 60 mg/day, adjust according to response. Daily doses >60 mg/day should be given in 2 divided doses. Elderly: No dosage adjustment needed. Hepatic impairment: 10-20 mg/day.",
    "childdose": "Oral GERD Indicated for treatment of GERD <1 year: Safety and efficacy not established > 1 year 5-10 kg: 5 mg PO qDay 10-20 kg: 10 mg PO qDay >20 kg: 20 mg PO qDay Erosive Esophagitis Indicated for treatment and to maintain healing of erosive esophagitis caused by acid-mediated GERD <1 month: Safety and efficacy not established Aged 1 month to <1 year 3 to <5 kg: 2.5 mg qDay 5 to <10 kg: 5 mg qDay >10 kg: 10 mg qDay May treat for up to 6 weeks Aged 1-16 years 5 to <10 kg: 5 mg PO qDay 10 to <20 kg: 10 mg PO qDay >20 kg: 20 mg PO qDay May treat for 4-8 weeks",
    "manufacturer": "Eskayef Pharceuticals Ltd."
  },
  {
    "id": 9,
    "medicine_name": "Alatrol 10mg",
    "description": "Alatrol 10 is an antihistaminic medication. It treats allergy symptoms such as itching, swelling, and rashes by blocking the effects of a chemical messenger (histamine) in the body.",
    "indications": "Allergic rhinitis, Hay fever, Allergies, Urticaria",
    "sideeffects": ">10% Somnolence (2-14%),Headache (11-14%) 1-10% Fatigue (5.9%),Dry mouth (5%),Dizziness (2%),Diarrhea (2-3%),Malaise (4%),Bronchospasm (2-3%),Vomiting (2-3%),Epistaxis (2-4%) <1% Stomach pain,Drowsiness,Angioedema,Fussiness,Hallucinations,Hypotension,Tremor,Tongue discoloration",
    "contraindications": "Hypersensitivity; lactation.",
    "usageinstructions": "May be taken with or without food.",
    "adultdose": "Oral Allergic conditions Adult: 10 mg once daily or 5 mg bid. Elderly: Initially, 5 mg once daily. Hepatic impairment: Initially, 5 mg once daily. Syrup: Adults: 2 teaspoon once daily or 1 teaspoon twice daily.",
    "childdose": "Oral Allergic conditions Child: 6-23 mth 2.5 mg once daily increased to max of 2.5 mg bid in childn >12 mth; 2-5 yr 5 mg once daily or in 2 divided doses; >6 yr 10 mg once daily or in 2 divided doses. Syrup: Children over 6 years: 2 teaspoon once daily or 1 teaspoon twice daily. Children 2-6 years: 1 teaspoonful once daily or 1/2 teaspoon twice daily. <2 years: Safety and efficacy not established",
    "manufacturer": "Square Pharmaceuticals PLC"
  },
  {
    "id": 10,
    "medicine_name": "Intimate 10mg",
    "description": "Intimate 10 is a phosphodiesterase (PDE-5) inhibitor. It works in erectile dysfunction by increasing blood flow to the penis by relaxing the muscles in penile blood vessels.",
    "indications": "Erectile dysfunction, signs and symptoms of benign prostatic hyperplasia (BPH)",
    "sideeffects": ">10% Headache (11-42%),Myalgia (1-14%),Respiratory tract infection (3-13%),Nasopharyngitis (2-13%),Dyspepsia (1-13%),Flushing (1-13%),Back pain (2-12%),Nausea (10-11%) 1-10% Nasal congestion (<9%),Gastroesophageal reflux disease (1-3%),Hypertension (1-3%),Bronchitis (<2%),Genitourinary tract infection (<2%) <1% Amnesia,Angina pectoris,Arthralgia,Change in color vision,Conjunctival hyperemia,Dyspnea,Epistaxis Potentially Fatal: Stevens-Johnson syndrome, exfoliative dermatitis, severe cardiovascular events e.g. MI, stroke, sudden cardiac death;",
    "contraindications": "Concurrent use of organic nitrates, nitrates and nitric oxide donors. Men with cardiac disease for whom sexual activity is inadvisable. Recent MI (within 90 days) or stroke (within last 6 mth), hypotension (<90/50 mm Hg), unstable angina, heart failure, uncontrolled arrhythmias or hypertension",
    "usageinstructions": "May be taken with or without food. In order for Tadalafil to be effective, sexual stimulation is required. It can be taken from 30 minutes to 12 hours prior to sexual activity. Efficacy of Tadalafil may persist up to 24 hours post-dose.",
    "adultdose": "Oral Erectile dysfunction Adult: For Use as Needed The recommended starting dose of Tadalafil for use as needed in most patients is 10 mg, taken prior to anticipated sexual activity. The dose may be increased to 20 mg or decreased to 5 mg, based on individual efficacy and tolerability. The maximum recommended dosing frequency is once per day in most patients. For Once Daily Use The recommended starting dose of Tadalafil for once daily use is 2.5 mg, taken at approximately the same time every day, without regard to timing of sexual activity. The IntimateTM dose for once daily use may be increased to 5 mg, based on individual efficacy and tolerability. Benign Prostatic Hyperplasia Treatment of signs and symptoms of benign prostatic hyperplasia (BPH); daily use also indicated for treatment of patients with both BPH and erectile dysfunction BPH: 5 mg PO once daily BPH with erectile dysfunction: 5 mg PO once daily, taken at approximately same time each day without regard to timing of sexual activity With finasteride for BPH: tadalafil 5 mg plus finasteride 5 mg PO once daily for <26 weeks Pulmonary Arterial Hypertension 40 mg PO once daily; dividing dose for more frequent dosing is not recommended Patients also taking ritonavir: 20 mg PO once daily initially for >1 week; may be increased to 40 mg/day on basis of tolerability Hepatic impairment (erectile dysfunction) Mild-to-moderate (Child-Pugh class A or B): Not to exceed 10 mg PO once daily Severe (Child-Pugh class C): Not recommended Hepatic impairment (pulmonary arterial hypertension) Mild-to-moderate (Child-Pugh class A or B): Consider starting dosage of 20 mg PO once daily Severe (Child-Pugh class C): Avoid use",
    "childdose": "None",
    "manufacturer": "Square Pharmaceuticals PLC"
  },
  {
    "id": 11,
    "medicine_name": "Nidocard RETARD 2.6mg",
    "description": "Nidocard RETARD 2.6 is a nitrate. It works by relaxing the blood vessels which decreases the oxygen demand of the heart and reduces its workload, thereby preventing/treating attacks of angina (chest pain).",
    "indications": "Angina pectoris, Acute myocardial infarction, Severe hypertension, Pulmonary edema.",
    "sideeffects": "Headache,Hypotension,Tachycardia,Dizziness,Lightheadedness,Blurred vision,Flushing,N/V,Nervousness,Xerostomia Serious Methemoglobinemia (rare),Syncope,Prolonged bleeding time,Exfoliative dermatitis,Unstable angina,Rebound hypertension,Thrombocytopenia Sublingual Tabs/Spray: Dry mouth, localised burning sensation. Buccal tablets: Delayed dissolution, may be swallowed by mistake. Potentially Fatal: Hypotension, paradoxical bradycardia, impaired respiration, syncope and collapse....",
    "contraindications": "Hypersensitivity. Severe hypotension, heart failure, marked anaemia, hypertrophic obstructive cardiomyopathy, cerebral haemorrhage or head trauma, low cardiac output secondary to hypovolaemia, inferior MI with right ventricular involvement, raised intracranial pressure. Concomitant use with phosphodiesterase type-5 inhibitors....",
    "usageinstructions": "None",
    "adultdose": "Oral Stable angina Adult: As SR tab/cap: 2.6-6.4 mg 3-4 times daily, adjust according to response. Max: 26 mg 4 times daily. Sublingual Tablet Angina Pectoris (Acute Relief) 0.5 mg SL q5min up to 3 times; use at first sign of angina Angina Pectoris (Prophylaxis) 1 tablet SL 5-10 minutes before activities likely to provoke angina attacks Sublingual Spray Angina 1-2 spray(s) PRN for angina, may repeat q3-5min, not to exceed 3 sprays in 15 minutes Spray onto or under tongue; do not inhale, expectorate or rinse mouth for 5-10 minutes Seek medical attention if pain persists after 3 doses in 15 minutes Angina, Prophylaxis 1-2 sprays 5-10 minutes before activities likely to cause angina Intravenous Acute myocardial infarction Adult: 10-100 mcg/min, w/ the dose initially at the lower rate, then increase gradually according to response. Induction of hypotension or control of hypertension during surgery Adult: Initially, 5-25 mcg/min, adjust according to response. Usual range: 10-200 mcg/min; doses up to 400 mcg/min may be required in some cases. ...",
    "childdose": "None",
    "manufacturer": "Drug International Ltd."
  },
  {
    "id": 12,
    "medicine_name": "Lumona 10mg",
    "description": "Lumona 10 works by blocking the action of leukotriene, a chemical messenger. This reduces inflammation in the airways to prevent asthma and relieve symptoms of allergies.",
    "indications": "Asthma, Allergic rhinitis",
    "sideeffects": ">10% Headache (18.4%; similar to placebo) 1-10% >2% Abdominal pain,Eczema,Influenza,Laryngitis,Pharyngitis,Viral infection,Wheezing,Dental pain,Dizziness,Dyspepsia, Dental pain (2%),Dizziness (2%),Dyspepsia (2%)Elevated liver function tests (2%),Fever (2%),Gastroenteritis (2%),Nasal congestion (2%),Otitis (2%),Rash (2%),Urticaria (2%), >1% Bronchitis,Cough,Sinusitis,Upper respiratory tract infection <1% Allergic granulomatous angiitis (Churg-Strauss syndrome; rare),Cholestatic hepatitis (rare),Aggressive behavior, altered behavior, suicidal thoughts Potentially Fatal: Anaphylaxis, Churg-Strauss syndrome.",
    "contraindications": "Hypersensitivity.",
    "usageinstructions": "None",
    "adultdose": "Oral Chronic asthma Adult: As film-coated tab: 10 mg once daily in the evening. Allergic rhinitis Adult: 10 mg once daily. Prophylaxis of exercise-induced asthma Adult: 10 mg at least 2 hr prior to exercise; do not take additional doses w/in 24 hr. Elderly: No dosage adjustment needed. Hepatic impairment: Mild to moderate: No dosage adjustment needed.",
    "childdose": "Asthma Prophylaxis and maintenance treatment in patients aged >12 months <12 months: Safety and efficacy not established 12-24 months: 4 mg (granules) PO once daily in evening 2-6 years: 4 mg (chewable tablet or granules) PO once daily in evening 6-15 years: 5 mg (chewable tablet) PO once daily in evening >15 years: 10 mg (conventional tablet) PO once daily in evening Exercise-Induced Bronchospasm Prophylaxis 6-15 years: 5 mg (chewable tablet) PO 2 hours before exercise; do not take additional dose within 24 hours >15 years: 10 mg PO 2 hours before exercise; do not take additional dose within 24 hours If taking drug for another indication, do not take additional dose to prevent EIB Perennial Allergic Rhinitis <6 months: Safety and efficacy not established 6-24 months: 4 mg (granules) PO once daily 2-6 years: 4 mg (chewable tablet or granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily Seasonal Allergic Rhinitis <2 years: Safety and efficacy not established 2-6 years: 5 mg (chewable tablet) or 4 mg (granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily",
    "manufacturer": "Eskayef Pharceuticals Ltd."
  },
  {
    "id": 13,
    "medicine_name": "Carva 75mg",
    "description": "Carva 75 is a non-steroidal anti-inflammatory drug (NSAID) with anti-platelet action. It works by preventing platelets from sticking together which decreases the formation of harmful blood clots. This lowers the chance of heart attack or stroke.",
    "indications": "PO Prophylaxis of myocardial infarction Adult: 75-300 mg once daily. Lower doses should be used in patients receiving ACE inhibitors. Stent implantation Adult: 300 mg 2 hr before procedure followed by 150-300 mg/day thereafter. Mild to moderate pain and fever Adult: 150-300 mg repeated every 4-6 hr according to response. Max: 4 g/day. Pain and inflammation associated with musculoskeletal and joint disorders Adult: Initial: 2.4-3.6 g/day in divided doses. Usual maintenance: 3.6-5.4 g/day. Monitor serum concentrations. Hepatic impairment: Severe liver disease: Not recommended .",
    "sideeffects": "Renal impairment CrCl >10 mL/min: Dose adjustment not necessary CrCl <10 mL/min: Not recommended",
    "contraindications": "PO Juvenile rheumatoid arthritis Child: <25 kg: 60-100 mg/kg/day PO divided q6-8hr (maintain serum salicylate at 150-300 mcg/mL) >25 kg: 2.4-3.6 g/day Pain & Fever <12 years 10-15 mg/kg PO q4hr, up to 60-80 mg/kg/day ",
    "usageinstructions": "Alcohol, corticosteroids, analgin, phenylbutazone and oxyphenbutazone may increase risk of GI ulceration. Aspirin increases phenytoin levels. May antagonize actions of uricosurics and spironolactone. Potentially Fatal: May potentiate effects of anticoagulants, methotrexate and oral hypoglycaemics.",
    "adultdose": "Patients with history of asthma, angioedema, urticaria or rhinitis, nasal polyp, severe renal or hepatic impairment, lactation. Lactation: Drug enters breast milk; decision should be made regarding whether to discontinue nursing or to discontinue drug, taking into account importance of drug to mother. ",
    "childdose": "Pregnancy category: C; D in 3rd trimester",
    "manufacturer": "Square Pharmaceuticals PLC"
  },
  {
    "id": 14,
    "medicine_name": "Cildip 10mg",
    "description": "Cildip 10 is a calcium channel blocker. It lowers blood pressure by relaxing blood vessels, which makes the heart more efficient at pumping blood throughout the body.",
    "indications": "Hypertension",
    "sideeffects": "Dizziness; flushing; headache; hypotension; peripheral oedema; tachycardia; palpitations; GI disturbances; increased micturition frequency; lethargy; eye pain; depression; ischaemic chest pain; cerebral or myocardial ischaemia; transient blindness; rashes; fever; abnormal liver function; gingival hyperplasia; myalgia; tremor; impotence. ",
    "contraindications": "Cardiogenic shock; recent MI or acute unstable angina; severe aortic stenosis.",
    "usageinstructions": "None",
    "adultdose": "Oral Hypertension Adult: 5-10 mg once daily, increase to 20 mg once daily if necessary.",
    "childdose": "None",
    "manufacturer": "Opsonin Pharma Limited"
  },
  {
    "id": 15,
    "medicine_name": "Montair 10mg",
    "description": "Montair 10 works by blocking the action of leukotriene, a chemical messenger. This reduces inflammation in the airways to prevent asthma and relieve symptoms of allergies.",
    "indications": "Asthma, Allergic rhinitis",
    "sideeffects": ">10% Headache (18.4%; similar to placebo) 1-10% >2% Abdominal pain,Eczema,Influenza,Laryngitis,Pharyngitis,Viral infection,Wheezing,Dental pain,Dizziness,Dyspepsia, Dental pain (2%),Dizziness (2%),Dyspepsia (2%)Elevated liver function tests (2%),Fever (2%),Gastroenteritis (2%),Nasal congestion (2%),Otitis (2%),Rash (2%),Urticaria (2%), >1% Bronchitis,Cough,Sinusitis,Upper respiratory tract infection <1% Allergic granulomatous angiitis (Churg-Strauss syndrome; rare),Cholestatic hepatitis (rare),Aggressive behavior, altered behavior, suicidal thoughts Potentially Fatal: Anaphylaxis, Churg-Strauss syndrome.",
    "contraindications": "Hypersensitivity.",
    "usageinstructions": "None",
    "adultdose": "Oral Chronic asthma Adult: As film-coated tab: 10 mg once daily in the evening. Allergic rhinitis Adult: 10 mg once daily. Prophylaxis of exercise-induced asthma Adult: 10 mg at least 2 hr prior to exercise; do not take additional doses w/in 24 hr. Elderly: No dosage adjustment needed. Hepatic impairment: Mild to moderate: No dosage adjustment needed.",
    "childdose": "Asthma Prophylaxis and maintenance treatment in patients aged >12 months <12 months: Safety and efficacy not established 12-24 months: 4 mg (granules) PO once daily in evening 2-6 years: 4 mg (chewable tablet or granules) PO once daily in evening 6-15 years: 5 mg (chewable tablet) PO once daily in evening >15 years: 10 mg (conventional tablet) PO once daily in evening Exercise-Induced Bronchospasm Prophylaxis 6-15 years: 5 mg (chewable tablet) PO 2 hours before exercise; do not take additional dose within 24 hours >15 years: 10 mg PO 2 hours before exercise; do not take additional dose within 24 hours If taking drug for another indication, do not take additional dose to prevent EIB Perennial Allergic Rhinitis <6 months: Safety and efficacy not established 6-24 months: 4 mg (granules) PO once daily 2-6 years: 4 mg (chewable tablet or granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily Seasonal Allergic Rhinitis <2 years: Safety and efficacy not established 2-6 years: 5 mg (chewable tablet) or 4 mg (granules) PO once daily 6-15 years: 5 mg (chewable tablet) PO once daily >15 years: 10 mg (conventional tablet) PO once daily",
    "manufacturer": "Incepta Pharmaceuticals LTD"
  }
]